donghuixin/WentaoInhaler_DueAudioChannel_nRF5340Firm/src/audio/audio_datapath.c
/*
 *  Copyright (c) 2021, PACKETCRAFT, INC.
 *
 *  SPDX-License-Identifier: LicenseRef-PCFT
 */

#include "audio_datapath.h"

#include <stdlib.h>
#include <stdio.h>
#include <ctype.h>
#include <zephyr/zbus/zbus.h>
#include <zephyr/kernel.h>
#include <zephyr/shell/shell.h>
#include <nrfx_clock.h>
#include <contin_array.h>
#include <tone.h>
#include <pcm_mix.h>

#include "zbus_common.h"
#include "macros_common.h"
#include "led.h"
#include "audio_i2s.h"
#include "sw_codec_select.h"
#include "audio_system.h"
#include "streamctrl.h"
#include "sd_card_playback.h"
#include "../bluetooth/gatt_services/audio_waveform_service.h"

#include "Equalizer.h"
#include "sdlogger_wrapper.h"

#include <zephyr/logging/log.h>
LOG_MODULE_REGISTER(audio_datapath, CONFIG_AUDIO_DATAPATH_LOG_LEVEL);

/*
 * Terminology
 *   - sample: signed integer of audio waveform amplitude
 *   - sample FIFO: circular array of raw audio samples
 *   - block: set of raw audio samples exchanged with I2S
 *   - frame: encoded audio packet exchanged with connectivity
 */

#define SDU_REF_DELTA_MAX_ERR_US (int)(CONFIG_AUDIO_FRAME_DURATION_US * 0.001)

#define BLK_PERIOD_US 1000

/* Total sample FIFO period in microseconds */
#define FIFO_SMPL_PERIOD_US (CONFIG_AUDIO_MAX_PRES_DLY_US * 2)
#define FIFO_NUM_BLKS	    NUM_BLKS(FIFO_SMPL_PERIOD_US)
#define MAX_FIFO_SIZE	    (FIFO_NUM_BLKS * BLK_SIZE_SAMPLES(CONFIG_AUDIO_SAMPLE_RATE_HZ) * 2)

/* Number of audio blocks given a duration */
#define NUM_BLKS(d) ((d) / BLK_PERIOD_US)
/* Single audio block size in number of samples (stereo) */
/* clang-format off */
#define BLK_SIZE_SAMPLES(r) (((r)*BLK_PERIOD_US) / 1000000)
/* clang-format on */
/* Increment sample FIFO index by one block */
#define NEXT_IDX(i) (((i) < (FIFO_NUM_BLKS - 1)) ? ((i) + 1) : 0)
/* Decrement sample FIFO index by one block */
#define PREV_IDX(i) (((i) > 0) ? ((i)-1) : (FIFO_NUM_BLKS - 1))

#define NUM_BLKS_IN_FRAME      NUM_BLKS(CONFIG_AUDIO_FRAME_DURATION_US)
#define BLK_MONO_NUM_SAMPS     BLK_SIZE_SAMPLES(CONFIG_AUDIO_SAMPLE_RATE_HZ)
#define BLK_STEREO_NUM_SAMPS   (BLK_MONO_NUM_SAMPS * 2)
/* Number of octets in a single audio block */
#define BLK_MONO_SIZE_OCTETS   (BLK_MONO_NUM_SAMPS * CONFIG_AUDIO_BIT_DEPTH_OCTETS)
#define BLK_STEREO_SIZE_OCTETS (BLK_MONO_SIZE_OCTETS * 2)
/* How many function calls before moving on with drift compensation */
#define DRIFT_COMP_WAITING_CNT (DRIFT_MEAS_PERIOD_US / BLK_PERIOD_US)
/* How much data to be collected before moving on with presentation compensation */
#define PRES_COMP_NUM_DATA_PTS (DRIFT_MEAS_PERIOD_US / CONFIG_AUDIO_FRAME_DURATION_US)

/* Audio clock - nRF5340 Analog Phase-Locked Loop (APLL) */
#define APLL_FREQ_MIN	 HFCLKAUDIO_12_165_MHZ
#define APLL_FREQ_CENTER HFCLKAUDIO_12_288_MHZ
#define APLL_FREQ_MAX	 HFCLKAUDIO_12_411_MHZ
/* Use nanoseconds to reduce rounding errors */
/* clang-format off */
#define APLL_FREQ_ADJ(t) (-((t)*1000) / 331)
/* clang-format on */

#define DRIFT_MEAS_PERIOD_US	   100000
#define DRIFT_ERR_THRESH_LOCK	   16
#define DRIFT_ERR_THRESH_UNLOCK	   32
/* To get smaller corrections */
#define DRIFT_REGULATOR_DIV_FACTOR 2

/* To allow BLE transmission and (host -> HCI -> controller) */
#define JUST_IN_TIME_TARGET_DLY_US 3000
#define JUST_IN_TIME_BOUND_US	   2500

/* How often to print under-run warning */
#define UNDERRUN_LOG_INTERVAL_BLKS 5000

enum drift_comp_state {
	DRIFT_STATE_INIT,   /* Waiting for data to be received */
	DRIFT_STATE_CALIB,  /* Calibrate and zero out local delay */
	DRIFT_STATE_OFFSET, /* Adjust I2S offset relative to SDU Reference */
	DRIFT_STATE_LOCKED  /* Drift compensation locked - Minor corrections */
};

static const char *const drift_comp_state_names[] = {
	"INIT",
	"CALIB",
	"OFFSET",
	"LOCKED",
};

enum pres_comp_state {
	PRES_STATE_INIT,  /* Initialize presentation compensation */
	PRES_STATE_MEAS,  /* Measure presentation delay */
	PRES_STATE_WAIT,  /* Wait for some time */
	PRES_STATE_LOCKED /* Presentation compensation locked */
};

static const char *const pres_comp_state_names[] = {
	"INIT",
	"MEAS",
	"WAIT",
	"LOCKED",
};

static void audio_datapath_i2s_rx_probe(uint32_t const *rx_buf)
{
	static uint32_t block_count;

	if (rx_buf == NULL) {
		return;
	}

#if CONFIG_AUDIO_BIT_DEPTH_16
	const int16_t *samples = (const int16_t *)rx_buf;
	const size_t sample_count = BLOCK_SIZE_BYTES / sizeof(int16_t);
	const size_t frame_count = sample_count / 2;

	(void)audio_waveform_service_submit_i2s_block(samples, frame_count);
#endif

	block_count++;

	if ((block_count > 5) && ((block_count % (1000000 / BLK_PERIOD_US)) != 0)) {
		return;
	}

#if CONFIG_AUDIO_BIT_DEPTH_16
	uint32_t sum_abs_l = 0;
	uint32_t sum_abs_r = 0;
	uint32_t peak_l = 0;
	uint32_t peak_r = 0;
	uint32_t nonzero_l = 0;
	uint32_t nonzero_r = 0;
	int16_t first_l = 0;
	int16_t first_r = 0;

	for (size_t i = 0; i + 1 < sample_count; i += 2) {
		int32_t left = samples[i];
		int32_t right = samples[i + 1];
		uint32_t abs_l = left < 0 ? (uint32_t)-left : (uint32_t)left;
		uint32_t abs_r = right < 0 ? (uint32_t)-right : (uint32_t)right;

		if (i == 0) {
			first_l = samples[i];
			first_r = samples[i + 1];
		}

		sum_abs_l += abs_l;
		sum_abs_r += abs_r;
		peak_l = MAX(peak_l, abs_l);
		peak_r = MAX(peak_r, abs_r);
		nonzero_l += left != 0;
		nonzero_r += right != 0;
	}

	LOG_WRN("ARX b=%u f=%u Lp=%u Lm=%u Ln=%u L0=%d Rp=%u Rm=%u Rn=%u R0=%d",
		block_count, (uint32_t)frame_count, peak_l,
		frame_count ? sum_abs_l / frame_count : 0, nonzero_l, first_l, peak_r,
		frame_count ? sum_abs_r / frame_count : 0, nonzero_r, first_r);
#else
	LOG_WRN("ARX b=%u r0=%08x r1=%08x bytes=%u",
		block_count, rx_buf[0], rx_buf[1], (unsigned int)BLOCK_SIZE_BYTES);
#endif
}

extern struct ring_buf ring_buffer;
extern struct k_mutex write_mutex;

static struct {
	bool datapath_initialized;
	bool stream_started;
	void *decoded_data;

	struct {
		struct data_fifo *fifo;
	} in;

	struct {
#if CONFIG_AUDIO_BIT_DEPTH_16
		int16_t __aligned(sizeof(uint32_t)) fifo[MAX_FIFO_SIZE];
#elif CONFIG_AUDIO_BIT_DEPTH_32
		int32_t __aligned(sizeof(uint32_t)) fifo[MAX_FIFO_SIZE];
#endif
		uint16_t prod_blk_idx; /* Output producer audio block index */
		uint16_t cons_blk_idx; /* Output consumer audio block index */
		uint32_t prod_blk_ts[FIFO_NUM_BLKS];
		/* Statistics */
		uint32_t total_blk_underruns;
	} out;

	uint32_t prev_drift_sdu_ref_us;
	uint32_t prev_pres_sdu_ref_us;
	uint32_t current_pres_dly_us;

