donghuixin/WentaoInhaler_DueAudioChannel_nRF5340Firm/src/audio/audio_datapath.c
	struct {
		enum drift_comp_state state: 8;
		uint16_t ctr; /* Count func calls. Used for waiting */
		uint32_t meas_start_time_us;
		uint32_t center_freq;
		bool enabled;
	} drift_comp;

	struct {
		enum pres_comp_state state: 8;
		uint16_t ctr; /* Count func calls. Used for collecting data points and waiting */
		int32_t sum_err_dly_us;
		uint32_t pres_delay_us;
		bool enabled;
	} pres_comp;
} ctrl_blk;

#include "openearable_common.h"

#define SENQUEUE_FRAME_SIZE 32

static struct k_msgq * sensor_queue;

//extern struct audio_data fifo_rx;

//K_MSGQ_DEFINE(rx_queue, sizeof(struct audio_data), 16, 4);
extern struct k_msgq_t encoder_queue;

// Definition eines zbus-Kanals
ZBUS_CHAN_DEFINE(audio_channel, struct audio_data, NULL, NULL, ZBUS_OBSERVERS_EMPTY, ZBUS_MSG_INIT(0));

// Thread-Stack und Daten
K_THREAD_STACK_DEFINE(data_thread_stack, CONFIG_ENCODER_STACK_SIZE); //CONFIG_DATA_THREAD_STACK_SIZE
static struct k_thread data_thread_data;
static k_tid_t data_thread_id;

bool _record_to_sd = false;

int _count = 0;

extern struct k_poll_signal encoder_sig;
extern struct k_poll_event logger_sig;

// Funktion für den neuen Thread
static void data_thread(void *arg1, void *arg2, void *arg3)
{
    //struct audio_data audio_item;
    void *tmp_pcm_raw_data[CONFIG_FIFO_FRAME_SPLIT_NUM];
    //char pcm_raw_data[FRAME_SIZE_BYTES];
    size_t pcm_block_size;
    int ret;

	struct audio_rx_data audio_item;
	//memcpy(audio_item.data, pcm_raw_data, FRAME_SIZE_BYTES);
	audio_item.size = FRAME_SIZE_BYTES;

    while (1) {
        // Daten aus der data_queue lesen
        for (int i = 0; i < CONFIG_FIFO_FRAME_SPLIT_NUM; i++) {
			// wait for next sample block to be available
            ret = data_fifo_pointer_last_filled_get(ctrl_blk.in.fifo, &tmp_pcm_raw_data[i], &pcm_block_size, K_FOREVER);
            ERR_CHK(ret);

			uint64_t time_stamp = micros();
    
            memcpy(audio_item.data + (i * BLOCK_SIZE_BYTES), tmp_pcm_raw_data[i], pcm_block_size);
    
            data_fifo_block_free(ctrl_blk.in.fifo, tmp_pcm_raw_data[i]);

			if (_record_to_sd) {
				struct sensor_msg audio_msg;
	
				audio_msg.sd = true;
				audio_msg.stream = false;
	
				audio_msg.data.id = ID_MICRO;
				audio_msg.data.size = BLOCK_SIZE_BYTES; // SENQUEUE_FRAME_SIZE;
				audio_msg.data.time = time_stamp;

				/*k_mutex_lock(&write_mutex, K_FOREVER);

				uint32_t data_size = sizeof(audio_msg.data.id) + sizeof(audio_msg.data.size) + sizeof(audio_msg.data.time); // + audio_msg.data.size;

				uint32_t bytes_written = ring_buf_put(&ring_buffer, (uint8_t *) &audio_msg.data, data_size);
				bytes_written += ring_buf_put(&ring_buffer, audio_item.data + (i * BLOCK_SIZE_BYTES), BLOCK_SIZE_BYTES);

				k_mutex_unlock(&write_mutex);*/

				uint32_t data_size[2] = {sizeof(audio_msg.data.id) + sizeof(audio_msg.data.size) + sizeof(audio_msg.data.time), BLOCK_SIZE_BYTES};

				const void *data_ptrs[2] = {
					&audio_msg.data,
					audio_item.data + (i * BLOCK_SIZE_BYTES)
				};

				sdlogger_write_data(&data_ptrs, data_size, 2);

				//sdlogger_write_data(&audio_msg.data, data_size);
				//sdlogger_write_data(audio_item.data + (i * BLOCK_SIZE_BYTES), BLOCK_SIZE_BYTES);
			}

			k_yield();
        }

		unsigned int signaled;
		k_poll_signal_check(&encoder_sig, &signaled, &ret);

		if (ret == 0 && signaled != 0) {
			ret = k_msgq_put(&encoder_queue, &audio_item, K_NO_WAIT);
			if (ret) {
				LOG_WRN("encoder queue full");
			}
		}
    }
}

/*void set_ring_buffer(struct ring_buf *buf)
{
	ring_buffer = buf;
}*/

void set_sensor_queue(struct k_msgq *queue)
{
	sensor_queue = queue;
}


void record_to_sd(bool active) {
	_record_to_sd = active;
}

// Funktion, um den neuen Thread zu starten
void start_data_thread(void)
{
	if (data_thread_id == NULL) {
		data_thread_id = k_thread_create(&data_thread_data, data_thread_stack, CONFIG_ENCODER_STACK_SIZE,
						data_thread, NULL, NULL, NULL,
						K_PRIO_PREEMPT(5), 0, K_NO_WAIT); //CONFIG_DATA_THREAD_PRIO
		k_thread_name_set(&data_thread_data, "data_thread");
	}

}

/**
 * @brief	Get the current number of blocks in the output buffer.
 */
static int filled_blocks_get(void)
{
	if (ctrl_blk.out.cons_blk_idx < ctrl_blk.out.prod_blk_idx) {
		return ctrl_blk.out.prod_blk_idx - ctrl_blk.out.cons_blk_idx;
	} else if (ctrl_blk.out.cons_blk_idx > ctrl_blk.out.prod_blk_idx) {
		return (FIFO_NUM_BLKS - ctrl_blk.out.cons_blk_idx) + ctrl_blk.out.prod_blk_idx;
	} else {
		return 0;
	}
}

static bool tone_active;
/* Buffer which can hold max 1 period test tone at 100 Hz */
static uint16_t test_tone_buf[CONFIG_AUDIO_SAMPLE_RATE_HZ / 100];
static size_t test_tone_size;

/**
 * @brief	Calculate error between sdu_ref and frame_start_ts_us.
 *
 * @note	Used to adjust audio clock to account for drift.
 *
 * @param	sdu_ref_us	Timestamp for SDU.
 * @param	frame_start_ts_us	Timestamp for I2S.
 *
 * @return	Error in microseconds (err_us).
 */
static int32_t err_us_calculate(uint32_t sdu_ref_us, uint32_t frame_start_ts_us)
{
	bool err_neg = false;

	int64_t total_err = ((int64_t)sdu_ref_us - (int64_t)frame_start_ts_us);

	/* Store sign for later use, since remainder operation is undefined for negatives */
	if (total_err < 0) {
		err_neg = true;
		total_err *= -1;
	}

	/* Check diff below 1000 us, diff above 1000 us is fixed later on */
	int32_t err_us = total_err % BLK_PERIOD_US;

	if (err_us > (BLK_PERIOD_US / 2)) {
		err_us = err_us - BLK_PERIOD_US;
	}

	/* Restore the sign */
	if (err_neg) {
		err_us *= -1;
	}

	return err_us;
}

static void hfclkaudio_set(uint16_t freq_value)
{
	uint16_t freq_val = freq_value;

	freq_val = MIN(freq_val, APLL_FREQ_MAX);
	freq_val = MAX(freq_val, APLL_FREQ_MIN);

	nrfx_clock_hfclkaudio_config_set(freq_val);
}

static void drift_comp_state_set(enum drift_comp_state new_state)
{
	if (new_state == ctrl_blk.drift_comp.state) {
		LOG_WRN("Trying to change to the same drift compensation state");
		return;
	}

	ctrl_blk.drift_comp.state = new_state;
	LOG_INF("Drft comp state: %s", drift_comp_state_names[new_state]);
}

/**
 * @brief	Adjust frequency of HFCLKAUDIO to get audio in sync.
 *
 * @note	The audio sync is based on sdu_ref_us.
 *
 * @param	frame_start_ts_us	I2S frame start timestamp.
 */
static void audio_datapath_drift_compensation(uint32_t frame_start_ts_us)
{
	if (CONFIG_AUDIO_DEV == HEADSET) {
		/** For headsets we do not use the timestamp gotten from hci_tx_sync_get to adjust
		 * for drift
		 */
		ctrl_blk.prev_drift_sdu_ref_us = ctrl_blk.prev_pres_sdu_ref_us;
	}
	switch (ctrl_blk.drift_comp.state) {
	case DRIFT_STATE_INIT: {
		/* Check if audio data has been received */
		if (ctrl_blk.prev_drift_sdu_ref_us) {
			ctrl_blk.drift_comp.meas_start_time_us = ctrl_blk.prev_drift_sdu_ref_us;

			drift_comp_state_set(DRIFT_STATE_CALIB);
		}

		break;
	}
	case DRIFT_STATE_CALIB: {
		if (++ctrl_blk.drift_comp.ctr < DRIFT_COMP_WAITING_CNT) {
			/* Waiting */
			return;
		}

		ctrl_blk.drift_comp.ctr = 0;

		int32_t err_us = DRIFT_MEAS_PERIOD_US - (ctrl_blk.prev_drift_sdu_ref_us -
							 ctrl_blk.drift_comp.meas_start_time_us);

		int32_t freq_adj = APLL_FREQ_ADJ(err_us);

		ctrl_blk.drift_comp.center_freq = APLL_FREQ_CENTER + freq_adj;

